Tekla Open API Reference for Tekla Structures 2025
View.DisplayType Property
The display plane type.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.DisplayOrientationType DisplayType { get; set; }
Public Property DisplayType As View.DisplayOrientationType
	Get
	Set
Property Value
Type: View.DisplayOrientationType
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace